# PANDAS

In [ ]:
# Pandas is a library that makes the analysis of complex, tabular dataset easy.

### Features

In [ ]:
# Defines tabular data types: database like tables with labeled rows and columns

# Data consolidation and data integration : remove the duplicates, cleaning the data, manage missing values,
# automatically align tables by index

# Summarization :  Create "pivot" tables

# In-memory, SQL like operations : join, aggregate(group by)

# Very flexible import/export data

# Date and time handling built-in, including timezones

# Easy visualization based on Matplotlib

## New Data Structures

In [ ]:
PANDA = PANel DAta = multi-dimensional data in stats & econometrics

# A series is a 1-D data structure

# A DataFrame is a 2-D data structure that can be viewed as a dictionary of Series

# A Panel is a 3-D data structure that can be viewed as a dictionary of DataFrames.

## Series

In [ ]:
#pandas.Series are indexed arrays

In [3]:
pip install pandas

Requirement already satisfied: pandas in /Users/erolozkan/opt/anaconda3/lib/python3.9/site-packages (1.4.4)
Requirement already satisfied: python-dateutil>=2.8.1 in /Users/erolozkan/opt/anaconda3/lib/python3.9/site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /Users/erolozkan/opt/anaconda3/lib/python3.9/site-packages (from pandas) (2022.1)
Requirement already satisfied: numpy>=1.18.5 in /Users/erolozkan/opt/anaconda3/lib/python3.9/site-packages (from pandas) (1.26.4)
Requirement already satisfied: six>=1.5 in /Users/erolozkan/opt/anaconda3/lib/python3.9/site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [2]:
import pandas as pd

In [4]:
from pandas import *

In [5]:
s = Series({'a' : 1,
            'b' : 2,
            'c' : 3
           })

In [6]:
s

a    1
b    2
c    3
dtype: int64

In [7]:
s['b']

2

In [8]:
s.index

Index(['a', 'b', 'c'], dtype='object')

In [9]:
s.values

array([1, 2, 3])

In [10]:
# Creating Series

In [ ]:
# From list and dictionary

In [11]:
my_index = ['a', 'b', 'c', 'd']
Series(range(4),
       index = my_index,
       name = 'first series')

a    0
b    1
c    2
d    3
Name: first series, dtype: int64

In [12]:
# data + indices in a dict

d = {'a' : 1,
     'b' : 2,
     'c' : 3,
     'd' : 4
    }
s = Series(d, name = 'second series')
s

a    1
b    2
c    3
d    4
Name: second series, dtype: int64

In [13]:
# From a Numpy Array

from numpy.random import randn

In [14]:
Series(randn(4), index = my_index)

a   -0.293774
b   -0.807770
c    0.439085
d    0.361373
dtype: float64

In [15]:
Series(randn(4), index = my_index)

a    0.099575
b    2.590114
c   -1.593892
d   -0.787707
dtype: float64

## DataFrames

In [ ]:
#  Dataframes have both row(index) and columns indices
#  Each column may have a different datatype
#  Adding a columns is 'cheap'

In [16]:
s1 = Series({'a' : 1, 'b' : 2, 'c' : 3 })
s2 = Series({'a' : True, 'b' :  False, 'c' : True })
df = DataFrame({'col1' : s1,
                'col2' : s2})

In [17]:
df

   col1   col2
a     1   True
b     2  False
c     3   True

In [18]:
df['col1']

a    1
b    2
c    3
Name: col1, dtype: int64

In [19]:
df['a']

KeyError: 'a'

In [20]:
# Creating DataFrames

In [21]:
# From a dict of series

s2 = Series([-0.9, -1.7, 1.1],
            index = my_index[1:])

In [23]:
s2

b   -0.9
c   -1.7
d    1.1
dtype: float64

In [1]:
d = { 'A' : s, 
      'B' : s2}

NameError: name 's' is not defined

In [26]:
df = DataFrame(d)

In [27]:
df

   A    B
a  1  NaN
b  2 -0.9
c  3 -1.7
d  4  1.1

In [28]:
df.columns

Index(['A', 'B'], dtype='object')

In [29]:
df.shape

(4, 2)

In [30]:
df.dtypes

A      int64
B    float64
dtype: object

In [31]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, a to d
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       4 non-null      int64
 1   B       3 non-null      float64
dtypes: float64(1), int64(1)
memory usage: 96.0+ bytes

In [32]:
df.head()

   A    B
a  1  NaN
b  2 -0.9
c  3 -1.7
d  4  1.1

In [33]:
df.describe()

              A         B
count  4.000000  3.000000
mean   2.500000 -0.500000
std    1.290994  1.442221
min    1.000000 -1.700000
25%    1.750000 -1.300000
50%    2.500000 -0.900000
75%    3.250000  0.100000
max    4.000000  1.100000

In [36]:
df.sample(2)

   A    B
c  3 -1.7
d  4  1.1

In [ ]:
# From a Numpy Array

In [38]:
DataFrame(randn(4, 4),
         index = my_index,
         columns = ['A', 'B', 'C', 'D'])

          A         B         C         D
a -2.519534 -0.427823 -0.628246  0.662024
b -0.122453 -0.990684  1.124327  1.274724
c  1.604755  0.810996 -0.561163 -0.675586
d  0.488222 -1.211237 -0.932084 -0.768257

In [42]:
df = DataFrame(randn(3, 3),
         index = my_index[1:],
         columns = ['A', 'B', 'C'])

In [43]:
df

          A         B         C
b -1.086911  0.735895  0.963224
c  0.557487  0.045066  0.186686
d  0.820091 -0.393948 -1.293440

In [ ]:
# Create a column

In [45]:
df['B'] > 0.5

b     True
c    False
d    False
Name: B, dtype: bool

In [46]:
df['flag'] = df['B'] > 0.5

In [47]:
df

          A         B         C   flag
b -1.086911  0.735895  0.963224   True
c  0.557487  0.045066  0.186686  False
d  0.820091 -0.393948 -1.293440  False

In [ ]:
# Importing Data

In [48]:
import pandas as pd

In [49]:
df_listings = pd.read_csv('listings.csv')

In [51]:
df_listings.head()

,id,name,host_id,host_name,neighbourhood_group,neighbourhood,latitude,longitude,room_type,price,minimum_nights,number_of_reviews,last_review,reviews_per_month,calculated_host_listings_count,availability_365,number_of_reviews_ltm,license
0,5456,"Walk to 6th, Rainey St and Convention Ctr",8028,Sylvia,NaN,78702,30.26057,-97.73441,Entire home/apt,107.0,2,671,2024-03-11,3.66,1,310,39,NaN
1,5769,NW Austin Room,8186,Elizabeth,NaN,78729,30.45697,-97.78422,Private room,45.0,1,295,2024-01-27,1.74,1,2,20,NaN
2,6413,Gem of a Studio near Downtown,13879,Todd,NaN,78704,30.24885,-97.73587,Entire home/apt,NaN,30,120,2022-10-17,0.69,1,0,0,NaN
3,6448,"Secluded Studio @ Zilker - King Bed, Bright & ...",14156,Amy,NaN,78704,30.26034,-97.76487,Entire home/apt,159.0,3,314,2024-03-13,2.06,1,190,22,NaN
4,8502,Woodland Studio Lodging,25298,Karen,NaN,78741,30.23466,-97.73682,Entire home/apt,48.0,4,51,2023-05-16,0.30,1,163,3,NaN

In [ ]:
http://bit.ly/chiporders

In [52]:
df_orders = pd.read_csv('http://bit.ly/chiporders')

ParserError: Error tokenizing data. C error: Expected 1 fields in line 6, saw 5

In [53]:
df_orders = pd.read_table('http://bit.ly/chiporders')

In [55]:
df_orders.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

In [57]:
df_order = pd.read_csv('http://bit.ly/chiporders', sep = '\t')

In [58]:
df_order.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

In [59]:
df_movie = pd.read_csv('http://bit.ly/movieusers', sep = '\t')

In [61]:
df_movie.head()

   1|24|M|technician|85711
0       2|53|F|other|94043
1      3|23|M|writer|32067
2  4|24|M|technician|43537
3       5|33|F|other|15213
4   6|42|M|executive|98101

In [62]:
df_movie = pd.read_csv('http://bit.ly/movieusers', sep = '|')

In [63]:
df_movie.head()

   1  24  M  technician  85711
0  2  53  F       other  94043
1  3  23  M      writer  32067
2  4  24  M  technician  43537
3  5  33  F       other  15213
4  6  42  M   executive  98101

In [64]:
user_cols = ['user_id', 'age', 'gender', 'occupation', 'zip_code']

In [69]:
df_movie = pd.read_csv('http://bit.ly/movieusers',
                       sep = '|',
                       header = None,
                       names = user_cols
                      )

In [70]:
df_movie.head()

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

In [73]:
df_movie.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 943 entries, 0 to 942
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   user_id     943 non-null    int64
 1   age         943 non-null    int64
 2   gender      943 non-null    object
 3   occupation  943 non-null    object
 4   zip_code    943 non-null    object
dtypes: int64(2), object(3)
memory usage: 37.0+ KB

In [72]:
df_movie.describe()

          user_id         age
count  943.000000  943.000000
mean   472.000000   34.051962
std    272.364951   12.192740
min      1.000000    7.000000
25%    236.500000   25.000000
50%    472.000000   31.000000
75%    707.500000   43.000000
max    943.000000   73.000000

In [75]:
df_movie.describe(include = ['object', 'int64'])

           user_id         age gender occupation zip_code
count   943.000000  943.000000    943        943      943
unique         NaN         NaN      2         21      795
top            NaN         NaN      M    student    55414
freq           NaN         NaN    670        196        9
mean    472.000000   34.051962    NaN        NaN      NaN
std     272.364951   12.192740    NaN        NaN      NaN
min       1.000000    7.000000    NaN        NaN      NaN
25%     236.500000   25.000000    NaN        NaN      NaN
50%     472.000000   31.000000    NaN        NaN      NaN
75%     707.500000   43.000000    NaN        NaN      NaN
max     943.000000   73.000000    NaN        NaN      NaN

In [101]:
df_ufo = pd.read_csv('http://bit.ly/uforeports')

In [78]:
df_ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [82]:
df_ufo['City'].head()

0                  Ithaca
1             Willingboro
2                 Holyoke
3                 Abilene
4    New York Worlds Fair
Name: City, dtype: object

In [83]:
df_ufo.City.head()

0                  Ithaca
1             Willingboro
2                 Holyoke
3                 Abilene
4    New York Worlds Fair
Name: City, dtype: object

In [84]:
df_ufo['Colors Reported'].head()

0    NaN
1    NaN
2    NaN
3    NaN
4    NaN
Name: Colors Reported, dtype: object

In [85]:
df_ufo.Colors Reported

SyntaxError: invalid syntax (4165062389.py, line 1)

In [91]:
df_ufo.columns

Index(['city', 'colors_reported', 'shape_reported', 'state', 'time'], dtype='object')

In [92]:
df_ufo.rename(columns = {'City' : 'city',
                         'Colors Reported' : 'colors_reported',
                         'Shape Reported' : 'shape_reported',
                         'State' : 'state',
                         'Time' : 'time'},
                          inplace = True)

In [94]:
df_ufo.head()

                   city colors_reported shape_reported state             time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [96]:
df_ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [102]:
df_ufo.columns = df_ufo.columns.str.replace(' ', '_')

In [103]:
df_ufo.head()

                   City Colors_Reported Shape_Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [105]:
df_ufo.columns = df_ufo.columns.str.lower()

In [106]:
df_ufo.head()

                   city colors_reported shape_reported state             time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00